from ursina import *
from ursina.prefabs.first_person_controller import FirstPersonController

__ = False

app = Ursina()
EditorCamera()
player = FirstPersonController(
    model='cube', position=(10, 2, 30), scale=3, color='#37aa29', collider='box'
    )

def input(key):
    if key == 'escape':
        application.quit()  

wall = [
    [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20],
    [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20],
    [1,2,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,19,20],
    [1,2,__,4,5,6,7,8,9,10,11,12,13,14,15,16,17,__,19,20],
    [1,2,__,4,5,6,7,8,9,10,11,12,13,14,15,16,17,__,19,20],
    [1,2,__,4,5,6,7,8,9,10,11,12,13,14,15,16,17,__,19,20],
    [1,2,__,4,5,6,7,8,9,10,11,12,13,14,15,16,17,__,19,20],
    [1,2,__,4,5,6,7,8,9,10,11,12,13,14,15,16,17,__,19,20],
    [1,2,__,4,5,6,7,8,9,10,11,12,13,14,15,16,17,__,19,20],
    [1,2,__,4,5,6,7,8,9,10,11,12,13,14,15,16,17,__,19,20],
    [1,2,__,4,5,6,7,8,9,10,11,12,13,14,15,16,17,__,19,20],
    [1,2,__,4,5,6,7,8,9,10,11,12,13,14,15,16,17,__,19,20],
    [1,2,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,19,20],
    [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20],
    [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]




]

lst = []

for i in range(len(wall)): #i는 행의 개수를 의미 >> 5
    for j in range(len(wall[i])): #j는 열의 개수를 의미 >> 10
        if wall[i][j]: #i, j 인자를 주소로 리스트 값에 접근해 T/F 판단
            test = Entity(
                model = 'cube',
                texture = 'brick',
                color = "#ee6f6f",
                scale = 5,
                position = (i * 5,0,j * 5),
                collider= 'box'
            )
            lst.append(test)


test = Entity(
    model = 'plane',
    texture = 'brick',
    color = "#000000",
    scale = 500,
    position = (0,0,0),
    collider= 'box'
    )



app.run()
